---
kind: method
id: M:Autodesk.Revit.DB.FormatOptions.Dispose
source: html/b0c1eeab-c4ed-cdc3-9d21-a37376cd58b8.htm
---
# Autodesk.Revit.DB.FormatOptions.Dispose Method

Releases all resources used by the FormatOptions

## Syntax (C#)
```csharp
public void Dispose()
```